#+title: Pets ontology, a minimal ELOT example
#+subtitle: An OWL ontology
#+author: John Doe
#+date: WIP

*** select query for OP domain/range
#+begin_src sparql :url "my-ont.omn" :eval never-export :exports both
  select *
  {
    ?OP a owl:ObjectProperty .
    optional { ?OP rdfs:domain ?domain }
    optional { ?OP rdfs:range ?range }
  } 
#+end_src

#+RESULTS:
| OP     | domain | range |
|--------+--------+-------|
| ex:chases | ex:dog    | ex:cat   |
